Revit 2024 API
RebarUpdateCurvesData.GetBarNominalDiameter Method
 Gets the nominal diameter of the Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public double GetBarNominalDiameter()
Visual Basic
Public Function GetBarNominalDiameter As Double
Visual C++
public:
double GetBarNominalDiameter()
Return Value
 Returns the nominal diameter of the Rebar.
See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace